function Dsy() {
 this.Items = {};
}
Dsy.prototype.add = function (id, iArray) {
 this.Items[id] = iArray;
}
Dsy.prototype.Exists = function (id) {
 if (typeof(this.Items[id]) == "undefined") return false;
 return true;
}

function change(v) {
 var str = "0";
 for (i = 0; i < v; i++) { str += ("_" + (document.getElementById(s[i]).selectedIndex - 1));}
 ;
 var ss = document.getElementById(s[v]);
 with (ss) {
 length = 0;
 options[0] = new Option(opt0[v], opt0[v]);
 if (v && document.getElementById(s[v - 1]).selectedIndex > 0 || !v) {
  if (dsy.Exists(str)) {
  ar = dsy.Items[str];
  for (i = 0; i < ar.length; i++)options[length] = new Option(ar[i], ar[i]);
  if (v)options[0].selected = true;
  }
 }
 if (++v < s.length) {change(v);}
 }
}
function preselect(p_key) {
 //alert(p_key);
 var index;

 var provinces = new Array("研究生院", "马克思主义学院", "经济学院", "法学院", "政治与公共管理学院", "人文学院", "教育学院", "体育学院", "文学与传媒学院", "国际学院", "民族文化学院", "外国语学院", "东南亚学院", "中印瑜伽学院", "数学与计算机科学学院", "电气信息工程学院", "化学与环境学院", "民族医药学院", "管理学院", "人民武装学院", "艺术学院", "职业技术学院", "应用技术学院", "继续教育学院", "预科教育学院", "民族工艺学院", "文化产业学院", "实体类科研机构", "校级平台类科研机构", "院级平台类科研机构", "云南民族干部学院", "驾驶培训中心", "东盟教育培训中心");
 var cnt = provinces.length;
 //alert(cnt);
 for (i = 0; i < cnt; i++) {
 if (p_key == provinces[i]) {
  index = i;
  break;
 }
 }
 if (index < provinces.length) {
 document.getElementById(s[0]).selectedIndex = index + 1;
 change(1);
 }
}

var dsy = new Dsy();

dsy.add("0", ["研究生院", "马克思主义学院", "经济学院", "法学院", "政治与公共管理学院", "人文学院", "教育学院", "体育学院", "文学与传媒学院", "国际学院", "民族文化学院", "外国语学院", "东南亚学院", "中印瑜伽学院", "数学与计算机科学学院", "电气信息工程学院", "化学与环境学院", "民族医药学院", "管理学院", "人民武装学院", "艺术学院", "职业技术学院", "应用技术学院", "继续教育学院", "预科教育学院", "民族工艺学院", "文化产业学院", "实体类科研机构", "校级平台类科研机构", "院级平台类科研机构", "云南民族干部学院", "驾驶培训中心", "东盟教育培训中心"]);



dsy.add("0_0", ["教学科"]);
dsy.add("0_0_0", ["建设办公室"]);
dsy.add("0_1", ["马克思主义基本原理","思想道德与法律基础","马克思主义民族理论与政策","中国近代史纲要","毛泽东思想与中国特色社会主义理论体系概论"]);
dsy.add("0_1_0", ["教研室"]);
dsy.add("0_1_1", ["教研室"]);
dsy.add("0_1_2", ["教研室"]);
dsy.add("0_1_3", ["教研室"]);
dsy.add("0_1_4", ["教研室"]);



dsy.add("0_2", ["国际经济与贸易系","经济学系","统计学系"]);
dsy.add("0_2_0", ["1班","2班"]);
dsy.add("0_2_1", ["1班","2班"]);
dsy.add("0_2_2", ["1班","2班"]);
dsy.add("0_2_3", ["1班","2班"]);



dsy.add("0_3", ["法律系"]);
dsy.add("0_3_0", ["1班","2班"]);



dsy.add("0_4", ["国际政治系", "思想政治系", "哲学系", "政治学系"]);
dsy.add("0_4_0", ["1班","2班"]);
dsy.add("0_4_1", ["1班","2班"]);
dsy.add("0_4_2", ["1班","2班"]);
dsy.add("0_4_3", ["1班","2班"]);



dsy.add("0_5", ["历史系", "民族学系", "社会学系", "新闻系", "中文系", "对外汉语"]);
dsy.add("0_5_0", ["1班", "2班"]);
dsy.add("0_5_1", ["1班", "2班"]);
dsy.add("0_5_2", ["1班", "2班"]);
dsy.add("0_5_3", ["1班", "2班"]);
dsy.add("0_5_4", ["1班", "2班"]);
dsy.add("0_5_5", ["1班", "2班"]);



dsy.add("0_6", ["教育技术学", "教育学", "小学教育", "心理学"]);
dsy.add("0_6_0", ["教研室"]);
dsy.add("0_6_1", ["教研室"]);
dsy.add("0_6_2", ["教研室"]);
dsy.add("0_6_3", ["教研室"]);



dsy.add("0_7", ["体育系"]);
dsy.add("0_7_0", ["1班", "2班"]);



dsy.add("0_8", ["文学传媒系"]);
dsy.add("0_8_0", ["1班", "2班"]);



dsy.add("0_9", ["国际文化系"]);
dsy.add("0_9_0", ["1班", "2班"]);



dsy.add("0_10", ["汉语系", "藏语系", "德傣语系", "哈尼语系", "景颠语系", "拉古语系", "傈僳语系", "苗语系", "佤语系", "西傣语系", "彝语系", "壮语系", "纳西语系"]);
dsy.add("0_10_0", ["1班", "2班"]);
dsy.add("0_10_1", ["1班", "2班"]);
dsy.add("0_10_2", ["1班", "2班"]);
dsy.add("0_10_3", ["1班", "2班"]);
dsy.add("0_10_4", ["1班", "2班"]);
dsy.add("0_10_5", ["1班", "2班"]);
dsy.add("0_10_6", ["1班", "2班"]);
dsy.add("0_10_7", ["1班", "2班"]);
dsy.add("0_10_8", ["1班", "2班"]);
dsy.add("0_10_9", ["1班", "2班"]);
dsy.add("0_10_10", ["1班", "2班"]);
dsy.add("0_10_11", ["1班", "2班"]);
dsy.add("0_10_12", ["1班", "2班"]);



dsy.add("0_11", ["韩语系", "日语系", "法语系", "英语系"]);
dsy.add("0_11_0", ["1班", "2班"]);
dsy.add("0_11_1", ["1班", "2班"]);
dsy.add("0_11_2", ["1班", "2班"]);
dsy.add("0_11_3", ["1班", "2班"]);



dsy.add("0_12", ["柬埔寨语系", "老挝语系", "马来语系", "缅甸语系", "泰语系", "印地语系", "印尼语系", "越南语系"]);
dsy.add("0_12_0", ["1班", "2班"]);
dsy.add("0_12_1", ["1班", "2班"]);
dsy.add("0_12_2", ["1班", "2班"]);
dsy.add("0_12_3", ["1班", "2班"]);
dsy.add("0_12_4", ["1班", "2班"]);
dsy.add("0_12_5", ["1班", "2班"]);
dsy.add("0_12_6", ["1班", "2班"]);
dsy.add("0_12_7", ["1班", "2班"]);



dsy.add("0_13", ["瑜伽系"]);
dsy.add("0_13_0", ["1班", "2班"]);



dsy.add("0_14", ["计算机系", "计算中心", "学院级", "数学系", "统计系", "信息与计算科学"])
dsy.add("0_14_0", ["教研室"]);
dsy.add("0_14_1", ["教研室"]);
dsy.add("0_14_2", ["实验室"]);
dsy.add("0_14_3", ["教研室"]);
dsy.add("0_14_4", ["教研室"]);
dsy.add("0_14_5", ["教研室"]);



dsy.add("0_15", ["电气系", "物理系", "信息系"]);
dsy.add("0_15_0", ["1班", "2班"]);
dsy.add("0_15_1", ["1班", "2班"]);
dsy.add("0_15_2", ["1班", "2班"]);



dsy.add("0_16", ["化学系", "环境系", "应用化学系"]);
dsy.add("0_16_0", ["1班", "2班"]);
dsy.add("0_16_1", ["1班", "2班"]);
dsy.add("0_16_2", ["1班", "2班"]);



dsy.add("0_17", ["制药工程系", "生物技术系"]);
dsy.add("0_17_0", ["1班", "2班"]);
dsy.add("0_17_1", ["1班", "2班"]);



dsy.add("0_18", ["工商系", "公共管理系", "会计系", "商旅系"]);
dsy.add("0_18_0", ["1班", "2班"]);
dsy.add("0_18_1", ["1班", "2班"]);
dsy.add("0_18_2", ["1班", "2班"]);
dsy.add("0_18_3", ["1班", "2班"]);



dsy.add("0_19", ["民大集团军"]);
dsy.add("0_19_0", ["坦克旅","步兵旅","海军航空兵","歼击机旅","海豹突击队","后勤旅","海军舰艇编队连","火箭军旅"]);



dsy.add("0_20", ["美术系", "设计系", "舞蹈系", "音乐系"]);
dsy.add("0_20_0", ["1班", "2班"]);
dsy.add("0_20_1", ["1班", "2班"]);
dsy.add("0_20_2", ["1班", "2班"]);
dsy.add("0_20_3", ["1班", "2班"]);



dsy.add("0_21", ["财经系", "旅游系", "人文系","艺术系","信息技术系"]);
dsy.add("0_21_0", ["1班", "2班"]);
dsy.add("0_21_1", ["1班", "2班"]);
dsy.add("0_21_2", ["1班", "2班"]);
dsy.add("0_21_3", ["1班", "2班"]);
dsy.add("0_21_4", ["计算机科学与技术", "信息技术与管理班"]);



dsy.add("0_22", ["应用技术系"]);
dsy.add("0_22_0", ["1班","2班"]);



dsy.add("0_23", ["继续教育系"]);
dsy.add("0_23_0", ["1班", "2班"]);



dsy.add("0_24", ["少数民族预科"]);
dsy.add("0_24_0", ["1班", "2班", "3班"]);



dsy.add("0_25", ["民族手工艺系"]);
dsy.add("0_25_0", ["1班", "2班"]);



dsy.add("0_26", ["传统文化产业系"]);
dsy.add("0_26_0", ["1班", "2班"]);



dsy.add("0_27", ["云南省民族科学", "陈新滋院士机构"]);
dsy.add("0_27_0", ["研究所"]);
dsy.add("0_27_1", ["工作站"]);



dsy.add("0_28", ["云南省民族文化", "云南省藏学", "云南省高等职业教育", "特色学科"]);
dsy.add("0_28_0", ["研究院"]);
dsy.add("0_28_1", ["研究中心"]);
dsy.add("0_28_2", ["科学研究所"]);
dsy.add("0_28_3", ["科研平台"]);



dsy.add("0_29", ["科研项目组"]);
dsy.add("0_29_0", ["科研1区", "科研2区"]);



dsy.add("0_30", ["干部教育培训中心"]);
dsy.add("0_30_0", ["1班", "2班"]);



dsy.add("0_31", ["科目1","科目2","科目3"]);
dsy.add("0_31_0", ["1班", "2班"]);
dsy.add("0_31_1", ["1班", "2班"]);
dsy.add("0_31_2", ["1班", "2班"]);



dsy.add("0_32", ["教育培训中心"]);
dsy.add("0_32_0", ["1班","2班"]);


var s = ["s1", "s2", "s3"];
var opt0 = ["学院", "专业系", "班级"];
function setup() {
 for (i = 0; i < s.length - 1; i++)
 document.getElementById(s[i]).onchange = new Function("change(" + (i + 1) + ");promptinfo();");
 change(0);
}